temp1/src/InformationRegisters/АвтоматизацияЖурнал/АвтоматизацияЖурнал.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>АвтоматизацияЖурнал</name>
  <attributes>
    <name>Сообщение</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>EnumRef.АвтоматизацияВидыЗаписейЖурнала</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Сценарий</name>
    <type>
      <types>CatalogRef.АвтоматизацияСценарии</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Источник</name>
    <type>
      <types>String</types>
      <types>AnyRef</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

temp1/src/Enums/АвтоматизацияВидыЗаписейЖурнала/АвтоматизацияВидыЗаписейЖурнала.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>АвтоматизацияВидыЗаписейЖурнала</name>
  <enumValues>
    <name>Информация</name>
  </enumValues>
  <enumValues>
    <name>Ошибка</name>
  </enumValues>
  <enumValues>
    <name>Предупреждение</name>
  </enumValues>
</mdclass:Enum>

temp1/src/InformationRegisters/АвтоматизацияЖурнал/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

Процедура ОтразитьВЖурнале(Сценарий, Источник, Тип = Неопределено, Сообщение = "", Дата = Неопределено) Экспорт
	
	УстановитьПривилегированныйРежим(Истина);
	
	ТипЗаписи = Перечисления.АвтоматизацияВидыЗаписейЖурнала.Информация;
	ТипЖурналаРегистрации = УровеньЖурналаРегистрации.Информация;
	Если ЗначениеЗаполнено(Тип) Тогда
		ТипЗаписи = Тип;
		ТипЖурналаРегистрации = УровеньЖурналаРегистрации[XMLСтрока(Тип)];
	КонецЕсли;
	МенеджерЗаписи = РегистрыСведений.АвтоматизацияЖурнал.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Сценарий	= Сценарий;
	МенеджерЗаписи.Источник	= Источник;
	МенеджерЗаписи.Дата	= ?(ЗначениеЗаполнено(Дата), Дата, ТекущаяДатаСеанса());
	МенеджерЗаписи.Сообщение = Сообщение;
	МенеджерЗаписи.Вид = ТипЗаписи;
	МенеджерЗаписи.Записать();
	
	ЗаписьЖурналаРегистрации(НСтр("ru = 'Автоматизация: Сценарии'"), 
		ТипЖурналаРегистрации, 
		Метаданные.Справочники.АвтоматизацияСценарии, , 
		Сообщение
	);			
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
